app/Models/M_Kaos.php

    public function getAllData(){
        return $this->db->table('kaos')->get();
---
SELECT *
FROM `kaos`